title: DEMO! Exploitation Indicators Of CVE-2022-21722
id: 2ece8816-b7a0-4d9b-b0e8-ae7ad18bc02b
status: experimental
description: THIS RULE IS A DEMO. DO NOT USE. IT DOES NOT DETECT CVE-2022-21722
references:
    - https://example.com/reference1
    - https://example.com/reference2
author: DOGESEC Demos
date: 2023/10/20
tags:
    - attack.privilege_escalation
    - attack.initial_access
    - attack.t1114
    - attack.T1190
    - detection.emerging_threats
    - cve.2024.56520
logsource:
    product: cisco
    service: syslog
    definition: 'Requirements: Cisco IOS XE system logs needs to be configured and ingested'
detection:
    keyword_event:
        - '%WEBUI-6-INSTALL_OPERATION_INFO:'
        - '%SYS-5-CONFIG_P:'
        - '%SEC_LOGIN-5-WEBLOGIN_SUCCESS:'
    keyword_user:
        - 'cisco_tac_admin'
        - 'cisco_support'
        - 'cisco_sys_manager'
    condition: keyword_event and keyword_user
falsepositives:
    - Rare false positives might occur if there are valid users named "cisco_tac_admin" or "cisco_support", which are not created by default or CISCO representatives
level: high